In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {'Name': ['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
         'Marks':[98,np.nan,99,87,np.nan,83,99],
         'Gender':['Male','Female','Female','Male','Male','Female','Female'],
         'Email': ['Priyang@gmail.com','aadhya@gmail.com','krisha@gmail.com','vedant@yahoo.com',
                   'parshv@hotmail.com','mittal@yahoo.com','archana@yahoo.com']
         
    
}
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [5]:
# Question 1: Display top 3 rows

df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [6]:
# Question 2: Last 3 rows
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [7]:
# Q3: All rows except last 2 rows
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [8]:
# Q4: All rows except first 3 rows
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [10]:
# Q5: Find the shape of the dataset
df1.shape

(7, 4)

In [15]:
print('Number of Rows',df1.shape[0])
print ('Number of Columns',df1.shape[1])

Number of Rows 7
Number of Columns 4

In [17]:
#Q6: Get info about the dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [19]:
#Q7: Check null values in the dataset
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [20]:
#Q8: Get overall statistics of the dataset
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [22]:
df1.describe(include= 'all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  Priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [24]:
#Q9: Find unique values from the gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [28]:
#Q10: Count od unique values in Gender column
df1['Gender'].nunique()

2

In [29]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [30]:
#Handling missing values
# One can provide argument to drop missing values
#Example 1: to drop any null or missing value from an observation (row)
df1.dropna(how='any')

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [31]:
#Example 1 shows how to drop rows that have any of their values as null,even if its just a single null value, any amount
#of null values

In [32]:
#Example 2: to drop any row that has all its values as null 9(has an entire row as missing)
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [33]:
#As seen above, no rows were dropped because none fits the description (no row had all its values as null)

In [34]:
df2= df1.dropna(how='any')
df2

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [3]:
# Replace missing values in marks with mean value
df1['Marks'] = df1['Marks'].fillna(df1['Marks'].mean())

In [13]:
#  Q11: Marks between 80 to 90
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [15]:
# Using between function
sum(df1['Marks'].between(80,90))

2

In [16]:
#Q12: Name of the students with the lowest marks
# Firstly use a min attribute and compare it to the data series
df1['Marks'].min()== df1['Marks']

#We can see that number 5 satisfies the argument

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: Marks, dtype: bool

In [18]:
#Then you can chose to bring out the name of the person using its position tag (5 as shown above to be true)

df1['Name'][5]

'Mittal'

In [23]:
#Or you can just make it easier by joining the ['Name'] to the comparison
df1[df1['Marks'].min()== df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [30]:
#Q13: Top 5 students by marks
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [33]:
# Or
df1.sort_values(by='Marks',ascending= False).head()[['Marks','Name']]

   Marks     Name
2   99.0   Krisha
6   99.0  Archana
0   98.0  Priyang
1   93.2   Aadhya
4   93.2   Parshv

In [3]:
def marks(x):
   return x/2 
df1['Marks'].apply(marks)

0    49.0
1     NaN
2    49.5
3    43.5
4     NaN
5    41.5
6    49.5
Name: Marks, dtype: float64

In [5]:
df1['Half Marks'] = df1['Marks'].apply(marks)

In [7]:
df1['Half Marks']

0    49.0
1    46.6
2    49.5
3    43.5
4    46.6
5    41.5
6    49.5
Name: Half Marks, dtype: float64

In [8]:
#Map Function
df1['Gender_Code'] = df1['Gender'].map({'Male':1,'Female':0})

In [9]:
df1['Gender_Code']

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender_Code, dtype: int64

In [10]:
df1.drop('Gender_Code', axis=1)

      Name  Marks  Gender               Email  Half Marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [11]:
df1

      Name  Marks  Gender               Email  Half Marks  Gender_Code
0  Priyang   98.0    Male   Priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
2   Krisha   99.0  Female    krisha@gmail.com        49.5            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0

In [15]:
# Inplace function - To make permanent an action
df1.drop('Gender_Code', axis=1, inplace=True)

#As can be seen below, if we run the code more than once, it gives an error message that 'Gender_Code' does not exist

KeyError: "['Gender_Code'] not found in axis"

In [16]:
df1

      Name  Marks  Gender               Email  Half Marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [18]:
#Sort the dataframe as per the marks column using the 'sort_values'
df1.sort_values(by='Marks')

      Name  Marks  Gender               Email  Half Marks
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
2   Krisha   99.0  Female    krisha@gmail.com        49.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [20]:
# Display Name $ Marks of the female students only
df1[df1['Gender']== 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [6]:
# You can achieve the same result as above using 'isin' attribute

df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya    NaN
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [7]:
f1=df1['Gender']=='Female'
f2=df1['Marks']
df1[df1.where(f1 & f2, other=0).all(1)]

      Name  Marks  Gender              Email
2   Krisha   99.0  Female   krisha@gmail.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [24]:
# Rename the marks columns
df1.rename(columns={'Marks':'Final_Marks'})

      Name  Final_Marks  Gender               Email  Half Marks
0  Priyang         98.0    Male   Priyang@gmail.com        49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5

In [4]:
# concatenate 2 datsets
# First lets create another dataframe
df2 = pd.DataFrame({'Name':'Anil','Marks':90,'Gender':'Male','Email':'anil@gmail.com'},index=[0])
df2

   Name  Marks Gender           Email
0  Anil     90   Male  anil@gmail.com

In [6]:
df3 = pd.concat([df1,df2],ignore_index=True)
df3

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com
7     Anil   90.0    Male      anil@gmail.com

In [8]:
# loc & iloc
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female

In [17]:
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female

In [19]:
df1.iloc[1,2]

'Female'

In [3]:
# Find the Highest Avg Value as per Gender
df1.groupby('Gender')['Marks'].mean()

Gender
Female    93.666667
Male      92.500000
Name: Marks, dtype: float64

In [6]:
# What are the top 5 most popular email providers
list1 = []
for email in df1['Email']:
    list1.append(email.split('@')[1])

In [7]:
list1

['gmail.com',
 'gmail.com',
 'gmail.com',
 'yahoo.com',
 'hotmail.com',
 'yahoo.com',
 'yahoo.com']

In [8]:
df1['temp']= list1
df1

      Name  Marks  Gender               Email         temp
0  Priyang   98.0    Male   Priyang@gmail.com    gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com    gmail.com
2   Krisha   99.0  Female    krisha@gmail.com    gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com    yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com  hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com    yahoo.com
6  Archana   99.0  Female   archana@yahoo.com    yahoo.com

In [13]:
df1['temp'].value_counts()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: temp, dtype: int64

In [5]:
# Or you can do everything in one line using the 'Lambda' function. Here's how:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts()

gmail.com      3
yahoo.com      3
hotmail.com    1
Name: Email, dtype: int64